Revit 2027 API
ParameterTypeId.StairsEnableCalculationRuleChecking Property
 "Enable Calculator Rules Check": Enable calculation rule checking
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsEnableCalculationRuleChecking { get; }
Public Shared ReadOnly Property StairsEnableCalculationRuleChecking As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsEnableCalculationRuleChecking {
	ForgeTypeId^ get ();
}
static member StairsEnableCalculationRuleChecking : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace